{
    "id2sign": {
        "0": "<s>",
        "2": "</s>",
        "1": "<pad>",
        "3": "<unk>",
        "4": "0",
        "5": "1",
        "6": "2",
        "7": "3",
        "8": "4",
        "9": "5",
        "10": "6",
        "11": "7",
        "12": "8",
        "13": "9",
        "14": "a",
        "15": "b",
        "16": "c",
        "17": "d",
        "18": "e",
        "19": "f",
        "20": "g",
        "21": "h",
        "22": "i",
        "23": "j",
        "24": "k",
        "25": "l",
        "26": "m",
        "27": "n",
        "28": "o",
        "29": "p",
        "30": "q",
        "31": "r",
        "32": "s",
        "33": "t",
        "34": "u",
        "35": "v",
        "36": "w",
        "37": "x",
        "38": "y",
        "39": "z",
        "40": "A",
        "41": "B",
        "42": "C",
        "43": "D",
        "44": "E",
        "45": "F",
        "46": "G",
        "47": "H",
        "48": "I",
        "49": "J",
        "50": "K",
        "51": "L",
        "52": "M",
        "53": "N",
        "54": "O",
        "55": "P",
        "56": "Q",
        "57": "R",
        "58": "S",
        "59": "T",
        "60": "U",
        "61": "V",
        "62": "W",
        "63": "X",
        "64": "Y",
        "65": "Z"
    },
    "sign2id": {
        "<s>": 0,
        "</s>": 2,
        "<pad>": 1,
        "<unk>": 3,
        "0": 4,
        "1": 5,
        "2": 6,
        "3": 7,
        "4": 8,
        "5": 9,
        "6": 10,
        "7": 11,
        "8": 12,
        "9": 13,
        "a": 14,
        "b": 15,
        "c": 16,
        "d": 17,
        "e": 18,
        "f": 19,
        "g": 20,
        "h": 21,
        "i": 22,
        "j": 23,
        "k": 24,
        "l": 25,
        "m": 26,
        "n": 27,
        "o": 28,
        "p": 29,
        "q": 30,
        "r": 31,
        "s": 32,
        "t": 33,
        "u": 34,
        "v": 35,
        "w": 36,
        "x": 37,
        "y": 38,
        "z": 39,
        "A": 40,
        "B": 41,
        "C": 42,
        "D": 43,
        "E": 44,
        "F": 45,
        "G": 46,
        "H": 47,
        "I": 48,
        "J": 49,
        "K": 50,
        "L": 51,
        "M": 52,
        "N": 53,
        "O": 54,
        "P": 55,
        "Q": 56,
        "R": 57,
        "S": 58,
        "T": 59,
        "U": 60,
        "V": 61,
        "W": 62,
        "X": 63,
        "Y": 64,
        "Z": 65
    }
}